; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	spectrograph1 - mode
	infrared2 - mode
	spectrograph4 - mode
	infrared3 - mode
	image0 - mode
	GroundStation0 - direction
	Star2 - direction
	GroundStation1 - direction
	Planet3 - direction
	Phenomenon4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph4)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet3)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 168)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 198)
	(supports instrument4 infrared3)
	(supports instrument4 image0)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 150)
	(supports instrument5 infrared2)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star2)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon4)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 111)
	(supports instrument6 spectrograph4)
	(supports instrument6 image0)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star2)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet3)
	(= (data_capacity satellite4) 1000)
	(= (fuel satellite4) 159)
	(= (data Planet3 spectrograph1) 284)
	(= (data Phenomenon4 spectrograph1) 173)
	(= (data Star5 spectrograph1) 31)
	(= (data Phenomenon6 spectrograph1) 252)
	(= (data Star7 spectrograph1) 215)
	(= (data Planet8 spectrograph1) 15)
	(= (data Planet9 spectrograph1) 195)
	(= (data Planet10 spectrograph1) 276)
	(= (data Planet11 spectrograph1) 252)
	(= (data Phenomenon12 spectrograph1) 279)
	(= (data Planet3 infrared2) 168)
	(= (data Phenomenon4 infrared2) 186)
	(= (data Star5 infrared2) 41)
	(= (data Phenomenon6 infrared2) 171)
	(= (data Star7 infrared2) 120)
	(= (data Planet8 infrared2) 296)
	(= (data Planet9 infrared2) 276)
	(= (data Planet10 infrared2) 12)
	(= (data Planet11 infrared2) 54)
	(= (data Phenomenon12 infrared2) 15)
	(= (data Planet3 spectrograph4) 241)
	(= (data Phenomenon4 spectrograph4) 220)
	(= (data Star5 spectrograph4) 58)
	(= (data Phenomenon6 spectrograph4) 255)
	(= (data Star7 spectrograph4) 65)
	(= (data Planet8 spectrograph4) 139)
	(= (data Planet9 spectrograph4) 158)
	(= (data Planet10 spectrograph4) 251)
	(= (data Planet11 spectrograph4) 202)
	(= (data Phenomenon12 spectrograph4) 243)
	(= (data Planet3 infrared3) 211)
	(= (data Phenomenon4 infrared3) 276)
	(= (data Star5 infrared3) 84)
	(= (data Phenomenon6 infrared3) 275)
	(= (data Star7 infrared3) 201)
	(= (data Planet8 infrared3) 184)
	(= (data Planet9 infrared3) 162)
	(= (data Planet10 infrared3) 155)
	(= (data Planet11 infrared3) 252)
	(= (data Phenomenon12 infrared3) 66)
	(= (data Planet3 image0) 146)
	(= (data Phenomenon4 image0) 146)
	(= (data Star5 image0) 182)
	(= (data Phenomenon6 image0) 213)
	(= (data Star7 image0) 251)
	(= (data Planet8 image0) 263)
	(= (data Planet9 image0) 196)
	(= (data Planet10 image0) 261)
	(= (data Planet11 image0) 97)
	(= (data Phenomenon12 image0) 139)
	(= (slew_time Star2 GroundStation0) 77.79)
	(= (slew_time GroundStation0 Star2) 77.79)
	(= (slew_time Star2 GroundStation1) 98.08)
	(= (slew_time GroundStation1 Star2) 98.08)
	(= (slew_time GroundStation1 GroundStation0) 16.24)
	(= (slew_time GroundStation0 GroundStation1) 16.24)
	(= (slew_time Planet3 GroundStation0) 42.79)
	(= (slew_time GroundStation0 Planet3) 42.79)
	(= (slew_time Planet3 GroundStation1) 56.55)
	(= (slew_time GroundStation1 Planet3) 56.55)
	(= (slew_time Planet3 Star2) 48.1)
	(= (slew_time Star2 Planet3) 48.1)
	(= (slew_time Phenomenon4 GroundStation0) 2.128)
	(= (slew_time GroundStation0 Phenomenon4) 2.128)
	(= (slew_time Phenomenon4 GroundStation1) 48.48)
	(= (slew_time GroundStation1 Phenomenon4) 48.48)
	(= (slew_time Phenomenon4 Star2) 30.44)
	(= (slew_time Star2 Phenomenon4) 30.44)
	(= (slew_time Phenomenon4 Planet3) 45.15)
	(= (slew_time Planet3 Phenomenon4) 45.15)
	(= (slew_time Star5 GroundStation0) 60.76)
	(= (slew_time GroundStation0 Star5) 60.76)
	(= (slew_time Star5 GroundStation1) 14.91)
	(= (slew_time GroundStation1 Star5) 14.91)
	(= (slew_time Star5 Star2) 65.49)
	(= (slew_time Star2 Star5) 65.49)
	(= (slew_time Star5 Planet3) 65.71)
	(= (slew_time Planet3 Star5) 65.71)
	(= (slew_time Star5 Phenomenon4) 33.34)
	(= (slew_time Phenomenon4 Star5) 33.34)
	(= (slew_time Phenomenon6 GroundStation0) 6.359)
	(= (slew_time GroundStation0 Phenomenon6) 6.359)
	(= (slew_time Phenomenon6 GroundStation1) 90.16)
	(= (slew_time GroundStation1 Phenomenon6) 90.16)
	(= (slew_time Phenomenon6 Star2) 32.22)
	(= (slew_time Star2 Phenomenon6) 32.22)
	(= (slew_time Phenomenon6 Planet3) 0.554)
	(= (slew_time Planet3 Phenomenon6) 0.554)
	(= (slew_time Phenomenon6 Phenomenon4) 19.98)
	(= (slew_time Phenomenon4 Phenomenon6) 19.98)
	(= (slew_time Phenomenon6 Star5) 22.47)
	(= (slew_time Star5 Phenomenon6) 22.47)
	(= (slew_time Star7 GroundStation0) 85.12)
	(= (slew_time GroundStation0 Star7) 85.12)
	(= (slew_time Star7 GroundStation1) 53.75)
	(= (slew_time GroundStation1 Star7) 53.75)
	(= (slew_time Star7 Star2) 1.75)
	(= (slew_time Star2 Star7) 1.75)
	(= (slew_time Star7 Planet3) 8.409)
	(= (slew_time Planet3 Star7) 8.409)
	(= (slew_time Star7 Phenomenon4) 5.308)
	(= (slew_time Phenomenon4 Star7) 5.308)
	(= (slew_time Star7 Star5) 22.5)
	(= (slew_time Star5 Star7) 22.5)
	(= (slew_time Star7 Phenomenon6) 51.96)
	(= (slew_time Phenomenon6 Star7) 51.96)
	(= (slew_time Planet8 GroundStation0) 25.61)
	(= (slew_time GroundStation0 Planet8) 25.61)
	(= (slew_time Planet8 GroundStation1) 39.91)
	(= (slew_time GroundStation1 Planet8) 39.91)
	(= (slew_time Planet8 Star2) 9.544)
	(= (slew_time Star2 Planet8) 9.544)
	(= (slew_time Planet8 Planet3) 19.44)
	(= (slew_time Planet3 Planet8) 19.44)
	(= (slew_time Planet8 Phenomenon4) 9.564)
	(= (slew_time Phenomenon4 Planet8) 9.564)
	(= (slew_time Planet8 Star5) 30.32)
	(= (slew_time Star5 Planet8) 30.32)
	(= (slew_time Planet8 Phenomenon6) 18.16)
	(= (slew_time Phenomenon6 Planet8) 18.16)
	(= (slew_time Planet8 Star7) 23.12)
	(= (slew_time Star7 Planet8) 23.12)
	(= (slew_time Planet9 GroundStation0) 32.87)
	(= (slew_time GroundStation0 Planet9) 32.87)
	(= (slew_time Planet9 GroundStation1) 0.1997)
	(= (slew_time GroundStation1 Planet9) 0.1997)
	(= (slew_time Planet9 Star2) 27.54)
	(= (slew_time Star2 Planet9) 27.54)
	(= (slew_time Planet9 Planet3) 31.32)
	(= (slew_time Planet3 Planet9) 31.32)
	(= (slew_time Planet9 Phenomenon4) 19.66)
	(= (slew_time Phenomenon4 Planet9) 19.66)
	(= (slew_time Planet9 Star5) 73.58)
	(= (slew_time Star5 Planet9) 73.58)
	(= (slew_time Planet9 Phenomenon6) 63.65)
	(= (slew_time Phenomenon6 Planet9) 63.65)
	(= (slew_time Planet9 Star7) 23.91)
	(= (slew_time Star7 Planet9) 23.91)
	(= (slew_time Planet9 Planet8) 40.82)
	(= (slew_time Planet8 Planet9) 40.82)
	(= (slew_time Planet10 GroundStation0) 44.13)
	(= (slew_time GroundStation0 Planet10) 44.13)
	(= (slew_time Planet10 GroundStation1) 29.2)
	(= (slew_time GroundStation1 Planet10) 29.2)
	(= (slew_time Planet10 Star2) 28.16)
	(= (slew_time Star2 Planet10) 28.16)
	(= (slew_time Planet10 Planet3) 12.85)
	(= (slew_time Planet3 Planet10) 12.85)
	(= (slew_time Planet10 Phenomenon4) 29.58)
	(= (slew_time Phenomenon4 Planet10) 29.58)
	(= (slew_time Planet10 Star5) 8.875)
	(= (slew_time Star5 Planet10) 8.875)
	(= (slew_time Planet10 Phenomenon6) 66.4)
	(= (slew_time Phenomenon6 Planet10) 66.4)
	(= (slew_time Planet10 Star7) 32.82)
	(= (slew_time Star7 Planet10) 32.82)
	(= (slew_time Planet10 Planet8) 16.74)
	(= (slew_time Planet8 Planet10) 16.74)
	(= (slew_time Planet10 Planet9) 4.661)
	(= (slew_time Planet9 Planet10) 4.661)
	(= (slew_time Planet11 GroundStation0) 53.75)
	(= (slew_time GroundStation0 Planet11) 53.75)
	(= (slew_time Planet11 GroundStation1) 69.98)
	(= (slew_time GroundStation1 Planet11) 69.98)
	(= (slew_time Planet11 Star2) 5.388)
	(= (slew_time Star2 Planet11) 5.388)
	(= (slew_time Planet11 Planet3) 35.44)
	(= (slew_time Planet3 Planet11) 35.44)
	(= (slew_time Planet11 Phenomenon4) 4.53)
	(= (slew_time Phenomenon4 Planet11) 4.53)
	(= (slew_time Planet11 Star5) 37)
	(= (slew_time Star5 Planet11) 37)
	(= (slew_time Planet11 Phenomenon6) 49.01)
	(= (slew_time Phenomenon6 Planet11) 49.01)
	(= (slew_time Planet11 Star7) 17.66)
	(= (slew_time Star7 Planet11) 17.66)
	(= (slew_time Planet11 Planet8) 2.212)
	(= (slew_time Planet8 Planet11) 2.212)
	(= (slew_time Planet11 Planet9) 20.82)
	(= (slew_time Planet9 Planet11) 20.82)
	(= (slew_time Planet11 Planet10) 3.065)
	(= (slew_time Planet10 Planet11) 3.065)
	(= (slew_time Phenomenon12 GroundStation0) 12.21)
	(= (slew_time GroundStation0 Phenomenon12) 12.21)
	(= (slew_time Phenomenon12 GroundStation1) 38.44)
	(= (slew_time GroundStation1 Phenomenon12) 38.44)
	(= (slew_time Phenomenon12 Star2) 64.97)
	(= (slew_time Star2 Phenomenon12) 64.97)
	(= (slew_time Phenomenon12 Planet3) 54.94)
	(= (slew_time Planet3 Phenomenon12) 54.94)
	(= (slew_time Phenomenon12 Phenomenon4) 39.65)
	(= (slew_time Phenomenon4 Phenomenon12) 39.65)
	(= (slew_time Phenomenon12 Star5) 9.396)
	(= (slew_time Star5 Phenomenon12) 9.396)
	(= (slew_time Phenomenon12 Phenomenon6) 38.16)
	(= (slew_time Phenomenon6 Phenomenon12) 38.16)
	(= (slew_time Phenomenon12 Star7) 29.27)
	(= (slew_time Star7 Phenomenon12) 29.27)
	(= (slew_time Phenomenon12 Planet8) 37.79)
	(= (slew_time Planet8 Phenomenon12) 37.79)
	(= (slew_time Phenomenon12 Planet9) 36.94)
	(= (slew_time Planet9 Phenomenon12) 36.94)
	(= (slew_time Phenomenon12 Planet10) 30.74)
	(= (slew_time Planet10 Phenomenon12) 30.74)
	(= (slew_time Phenomenon12 Planet11) 62.61)
	(= (slew_time Planet11 Phenomenon12) 62.61)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite4 Phenomenon4)
	(have_image Planet3 image0)
	(have_image Phenomenon4 spectrograph4)
	(have_image Star5 spectrograph4)
	(have_image Phenomenon6 image0)
	(have_image Star7 spectrograph4)
	(have_image Planet8 spectrograph4)
	(have_image Planet9 infrared3)
	(have_image Planet10 infrared2)
	(have_image Planet11 spectrograph1)
	(have_image Phenomenon12 spectrograph4)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 groundstation1 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 168 to 111.45, (fuel-used) from 0 to 56.55
   goals met: 0 of 12
2. (turn_to satellite0 planet11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet11)
   changed: (fuel satellite0) from 111.45 to 41.47, (fuel-used) from 56.55 to 126.53
   goals met: 0 of 12
3. (turn_to satellite4 phenomenon4 planet3)
   deleted: (pointing satellite4 planet3)
   added: (pointing satellite4 phenomenon4)
   changed: (fuel satellite4) from 159 to 113.85, (fuel-used) from 126.53 to 171.68
   goals met: 1 of 12
4. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 12
5. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 41.47 to 38.405, (fuel-used) from 171.68 to 174.745
   goals met: 1 of 12
6. (turn_to satellite0 planet11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet11)
   changed: (fuel satellite0) from 38.405 to 35.34, (fuel-used) from 174.745 to 177.81
   goals met: 1 of 12
7. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 12
8. (turn_to satellite4 groundstation0 phenomenon4)
   deleted: (pointing satellite4 phenomenon4)
   added: (pointing satellite4 groundstation0)
   changed: (fuel satellite4) from 113.85 to 111.722, (fuel-used) from 177.81 to 179.938
   goals met: 0 of 12
9. (turn_to satellite4 phenomenon4 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon4)
   changed: (fuel satellite4) from 111.722 to 109.594, (fuel-used) from 179.938 to 182.066
   goals met: 1 of 12
10. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 1 of 12
11. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 12
12. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 35.34 to 32.275, (fuel-used) from 182.066 to 185.131
   goals met: 1 of 12
13. (turn_to satellite0 planet11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet11)
   changed: (fuel satellite0) from 32.275 to 29.21, (fuel-used) from 185.131 to 188.196
   goals met: 1 of 12
14. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 1 of 12
15. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 12
16. (turn_to satellite4 groundstation0 phenomenon4)
   deleted: (pointing satellite4 phenomenon4)
   added: (pointing satellite4 groundstation0)
   changed: (fuel satellite4) from 109.594 to 107.466, (fuel-used) from 188.196 to 190.324
   goals met: 0 of 12
17. (calibrate satellite4 instrument6 groundstation0)
   added: (calibrated instrument6)
   goals met: 0 of 12
18. (turn_to satellite4 phenomenon4 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon4)
   changed: (fuel satellite4) from 107.466 to 105.338, (fuel-used) from 190.324 to 192.452
   goals met: 1 of 12
19. (turn_to satellite4 star7 phenomenon4)
   deleted: (pointing satellite4 phenomenon4)
   added: (pointing satellite4 star7)
   changed: (fuel satellite4) from 105.338 to 100.03, (fuel-used) from 192.452 to 197.76
   goals met: 0 of 12
20. (take_image satellite4 star7 instrument6 spectrograph4)
   added: (have_image star7 spectrograph4)
   changed: (data_capacity satellite4) from 1000 to 935, (data-stored) from 0 to 65
   goals met: 1 of 12
21. (turn_to satellite4 phenomenon4 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 phenomenon4)
   changed: (fuel satellite4) from 100.03 to 94.722, (fuel-used) from 197.76 to 203.068
   goals met: 2 of 12
22. (turn_to satellite4 groundstation0 phenomenon4)
   deleted: (pointing satellite4 phenomenon4)
   added: (pointing satellite4 groundstation0)
   changed: (fuel satellite4) from 94.722 to 92.594, (fuel-used) from 203.068 to 205.196
   goals met: 1 of 12
23. (turn_to satellite4 phenomenon4 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon4)
   changed: (fuel satellite4) from 92.594 to 90.466, (fuel-used) from 205.196 to 207.324
   goals met: 2 of 12
24. (turn_to satellite4 groundstation0 phenomenon4)
   deleted: (pointing satellite4 phenomenon4)
   added: (pointing satellite4 groundstation0)
   changed: (fuel satellite4) from 90.466 to 88.338, (fuel-used) from 207.324 to 209.452
   goals met: 1 of 12
25. (turn_to satellite4 phenomenon4 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon4)
   changed: (fuel satellite4) from 88.338 to 86.21, (fuel-used) from 209.452 to 211.58
   goals met: 2 of 12
26. (turn_to satellite4 groundstation0 phenomenon4)
   deleted: (pointing satellite4 phenomenon4)
   added: (pointing satellite4 groundstation0)
   changed: (fuel satellite4) from 86.21 to 84.082, (fuel-used) from 211.58 to 213.708
   goals met: 1 of 12
27. (turn_to satellite4 phenomenon4 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon4)
   changed: (fuel satellite4) from 84.082 to 81.954, (fuel-used) from 213.708 to 215.836
   goals met: 2 of 12
28. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 12
29. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 12
30. (turn_to satellite4 planet3 phenomenon4)
   deleted: (pointing satellite4 phenomenon4)
   added: (pointing satellite4 planet3)
   changed: (fuel satellite4) from 81.954 to 36.804, (fuel-used) from 215.836 to 260.986
   goals met: 1 of 12
31. (take_image satellite4 planet3 instrument6 image0)
   added: (have_image planet3 image0)
   changed: (data_capacity satellite4) from 935 to 789, (data-stored) from 65 to 211
   goals met: 2 of 12
32. (turn_to satellite4 phenomenon6 planet3)
   deleted: (pointing satellite4 planet3)
   added: (pointing satellite4 phenomenon6)
   changed: (fuel satellite4) from 36.804 to 36.25, (fuel-used) from 260.986 to 261.54
   goals met: 2 of 12
33. (take_image satellite4 phenomenon6 instrument6 image0)
   added: (have_image phenomenon6 image0)
   changed: (data_capacity satellite4) from 789 to 576, (data-stored) from 211 to 424
   goals met: 3 of 12
34. (turn_to satellite4 groundstation0 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 groundstation0)
   changed: (fuel satellite4) from 36.25 to 29.891, (fuel-used) from 261.54 to 267.899
   goals met: 3 of 12
35. (turn_to satellite4 phenomenon4 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon4)
   changed: (fuel satellite4) from 29.891 to 27.763, (fuel-used) from 267.899 to 270.027
   goals met: 4 of 12
36. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 29.21 to 26.145, (fuel-used) from 270.027 to 273.092
   goals met: 4 of 12
37. (turn_to satellite4 planet11 phenomenon4)
   deleted: (pointing satellite4 phenomenon4)
   added: (pointing satellite4 planet11)
   changed: (fuel satellite4) from 27.763 to 23.233, (fuel-used) from 273.092 to 277.622
   goals met: 3 of 12
38. (turn_to satellite4 planet8 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet8)
   changed: (fuel satellite4) from 23.233 to 21.021, (fuel-used) from 277.622 to 279.834
   goals met: 3 of 12
39. (take_image satellite4 planet8 instrument6 spectrograph4)
   added: (have_image planet8 spectrograph4)
   changed: (data_capacity satellite4) from 576 to 437, (data-stored) from 424 to 563
   goals met: 4 of 12
40. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 12
41. (turn_to satellite4 planet11 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 planet11)
   changed: (fuel satellite4) from 21.021 to 18.809, (fuel-used) from 279.834 to 282.046
   goals met: 4 of 12
42. (turn_to satellite4 planet10 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet10)
   changed: (fuel satellite4) from 18.809 to 15.744, (fuel-used) from 282.046 to 285.111
   goals met: 4 of 12
43. (take_image satellite4 planet10 instrument6 infrared2)
   added: (have_image planet10 infrared2)
   changed: (data_capacity satellite4) from 437 to 425, (data-stored) from 563 to 575
   goals met: 5 of 12
44. (turn_to satellite4 planet11 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 planet11)
   changed: (fuel satellite4) from 15.744 to 12.679, (fuel-used) from 285.111 to 288.176
   goals met: 5 of 12
45. (turn_to satellite4 phenomenon4 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 phenomenon4)
   changed: (fuel satellite4) from 12.679 to 8.149, (fuel-used) from 288.176 to 292.706
   goals met: 6 of 12
46. (take_image satellite4 phenomenon4 instrument6 spectrograph4)
   added: (have_image phenomenon4 spectrograph4)
   changed: (data_capacity satellite4) from 425 to 205, (data-stored) from 575 to 795
   goals met: 7 of 12
47. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 7 of 12
48. (turn_to satellite0 planet9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet9)
   changed: (fuel satellite0) from 26.145 to 21.484, (fuel-used) from 292.706 to 297.367
   goals met: 7 of 12
49. (turn_to satellite3 planet11 phenomenon4)
   deleted: (pointing satellite3 phenomenon4)
   added: (pointing satellite3 planet11)
   changed: (fuel satellite3) from 111 to 106.47, (fuel-used) from 297.367 to 301.897
   goals met: 7 of 12
50. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 7 of 12
51. (turn_to satellite3 star2 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 star2)
   changed: (fuel satellite3) from 106.47 to 101.082, (fuel-used) from 301.897 to 307.285
   goals met: 7 of 12
52. (turn_to satellite3 planet11 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 planet11)
   changed: (fuel satellite3) from 101.082 to 95.694, (fuel-used) from 307.285 to 312.673
   goals met: 7 of 12
53. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 7 of 12
54. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 7 of 12
55. (turn_to satellite0 groundstation1 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 21.484 to 21.2843, (fuel-used) from 312.673 to 312.873
   goals met: 7 of 12
56. (turn_to satellite3 star2 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 star2)
   changed: (fuel satellite3) from 95.694 to 90.306, (fuel-used) from 312.873 to 318.261
   goals met: 7 of 12
57. (calibrate satellite3 instrument5 star2)
   added: (calibrated instrument5)
   goals met: 7 of 12
58. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 7 of 12
59. (turn_to satellite0 planet9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet9)
   changed: (fuel satellite0) from 21.2843 to 21.0846, (fuel-used) from 318.261 to 318.46
   goals met: 7 of 12
60. (take_image satellite0 planet9 instrument2 infrared3)
   added: (have_image planet9 infrared3)
   changed: (data_capacity satellite0) from 1000 to 838, (data-stored) from 795 to 957
   goals met: 8 of 12
61. (turn_to satellite0 planet10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 21.0846 to 16.4236, (fuel-used) from 318.46 to 323.121
   goals met: 8 of 12
62. (turn_to satellite0 star5 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 16.4236 to 7.5486, (fuel-used) from 323.121 to 331.996
   goals met: 9 of 12
63. (turn_to satellite3 planet11 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 planet11)
   changed: (fuel satellite3) from 90.306 to 84.918, (fuel-used) from 331.996 to 337.384
   goals met: 9 of 12
64. (take_image satellite0 star5 instrument2 spectrograph4)
   added: (have_image star5 spectrograph4)
   changed: (data_capacity satellite0) from 838 to 780, (data-stored) from 957 to 1015
   goals met: 10 of 12
65. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 10 of 12
66. (turn_to satellite2 groundstation1 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 150 to 111.56, (fuel-used) from 337.384 to 375.824
   goals met: 10 of 12
67. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 10 of 12
68. (turn_to satellite2 phenomenon12 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon12)
   changed: (fuel satellite2) from 111.56 to 73.12, (fuel-used) from 375.824 to 414.264
   goals met: 10 of 12
69. (take_image satellite3 planet11 instrument5 spectrograph1)
   added: (have_image planet11 spectrograph1)
   changed: (data_capacity satellite3) from 1000 to 748, (data-stored) from 1015 to 1267
   goals met: 11 of 12
70. (take_image satellite2 phenomenon12 instrument4 spectrograph4)
   added: (have_image phenomenon12 spectrograph4)
   changed: (data_capacity satellite2) from 1000 to 757, (data-stored) from 1267 to 1510
   goals met: 12 of 12
